src/Catalogs/ГруппыСчетчиков/ГруппыСчетчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыСчетчиков</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ПолныйКодДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>620</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьУстановитьПометкуУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольПоступленияДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеВремяОтсутствияДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/СтатистикаНеделя/СтатистикаНеделя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаНеделя</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЧислоСрабатываний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднееЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>CatalogRef.ГруппыСчетчиков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ГруппыСчетчиковФормаСписка/ГруппыСчетчиковФормаСписка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГруппыСчетчиковФормаСписка</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Счетчик</name>
    <type>
      <types>CatalogRef.ГруппыСчетчиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификаторФормы</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ГруппыСчетчиковФормаСпискаЕстьКонтрольПодчиненных/ГруппыСчетчиковФормаСпискаЕстьКонтрольПодчиненных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГруппыСчетчиковФормаСпискаЕстьКонтрольПодчиненных</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЕстьКонтрольПодчиненных</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Счетчик</name>
    <type>
      <types>CatalogRef.ГруппыСчетчиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификаторФормы</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ПоказателиИнцидентов/ПоказателиИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиИнцидентов</name>
  <owners>Catalog.ОбнаружениеИнцидентов</owners>
  <attributes>
    <name>Функция</name>
    <type>
      <types>EnumRef.ФункцииОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ЧислоНовыхОбъектов</types>
      <types>CatalogRef.ЧислоПаденийРабочихПроцессов</types>
      <types>CatalogRef.ЧислоСеансовПользователей</types>
      <types>CatalogRef.ИспользованиеОперативнойПамятиПроцессамиКластера</types>
      <types>CatalogRef.ПоказателиAPDEX</types>
      <types>CatalogRef.СкоростьРазбораПроблем</types>
      <types>CatalogRef.ТекущееЧислоВызововСервера</types>
      <types>CatalogRef.ЧислоИсключенийПоТехнологическомуЖурналу</types>
      <types>CatalogRef.ОценкаПользователей</types>
      <types>CatalogRef.ПроцентДоступностиСервисаВсеБазы</types>
      <types>CatalogRef.СформированоОтчетов</types>
      <types>CatalogRef.ПоказателиСкоростиВыполненияТипичныхОпераций</types>
      <types>CatalogRef.ЧислоНерешенныхПроблем</types>
      <types>CatalogRef.ПроцентДоступностиСервисаВсеРесурсы</types>
      <types>CatalogRef.ПоказателиСчетчиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаВремениИнтервалаРасчета</name>
    <type>
      <types>EnumRef.ЕдиницыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>СравниватьСПрошлым</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СмещениеБазы</name>
    <type>
      <types>EnumRef.ВариантыСмещенияБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалБазы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаВремениИнтервалаБазы</name>
    <type>
      <types>EnumRef.ЕдиницыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСравнения</name>
    <type>
      <types>EnumRef.ВидыСравненияПоказателейОповещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Порог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогВПроцентах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматнаяСтрокаЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ПоказателиСчетчиков/ПоказателиСчетчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиСчетчиков</name>
  <owners>Catalog.ПоказателиМониторинга</owners>
  <owners>Catalog.ПоказателиОповещений</owners>
  <owners>Catalog.ПоказателиИнцидентов</owners>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТипаПоказателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикиВыбран</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикиРежимВыбора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Счетчики</name>
    <attributes>
      <name>Счетчик</name>
      <type>
        <types>CatalogRef.ГруппыСчетчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АвтовыборПараметры</name>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеУсловия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеСоединения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ГруппыСчетчиков/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если ЭтотОбъект.Параметры.Свойство("ОбнаружениеИнцидента") Тогда
        
        
        НовыйОтбор = Новый ОтборКомпоновкиДанных;
        НовЭлемент = НовыйОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        НовЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
        НовЭлемент.Использование = Истина;
        НовЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОбнаружениеИнцидентов");
        НовЭлемент.ПравоеЗначение = ЭтотОбъект.Параметры.ОбнаружениеИнцидента;
        
        КопироватьОтбор(ЭтотОбъект.Список.Отбор, НовыйОтбор);
        СохранитьОтбор(НастройкаОтбораСписка, НовыйОтбор);	
	    ЭтотОбъект.ОтборПредставление = Строка(НовыйОтбор);
        
        ЭтотОбъект.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
        ЭтотОбъект.Элементы.КодДляПоиска.Видимость = Ложь;
        ЭтотОбъект.Элементы.КодДляПоискаСписок.Видимость = Истина;
                
    КонецЕсли;
    
    ЗаполнитьТекущиеЗначения(ЭтотОбъект.УникальныйИдентификатор);
	Список.Параметры.УстановитьЗначениеПараметра("УникальныйИдентификаторФормы", ЭтотОбъект.УникальныйИдентификатор);
    
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
    
    КопироватьОтбор(ЭтотОбъект.Список.Отбор, ВыбранноеЗначение);
	СохранитьОтбор(НастройкаОтбораСписка, ВыбранноеЗначение);	
	ЭтотОбъект.ОтборПредставление = Строка(ВыбранноеЗначение);
    
    Если ЭтотОбъект.Список.Отбор.Элементы.Количество() > 0 Тогда
        ЭтотОбъект.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
        ЭтотОбъект.Элементы.КодДляПоиска.Видимость = Ложь;
        ЭтотОбъект.Элементы.КодДляПоискаСписок.Видимость = Истина;
    Иначе
        ЭтотОбъект.Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
        ЭтотОбъект.Элементы.КодДляПоиска.Видимость = Истина;
        ЭтотОбъект.Элементы.КодДляПоискаСписок.Видимость = Ложь;
    КонецЕсли;
        
	ОбновитьСписок(Неопределено);
    
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
    
    Если ЗначениеЗаполнено(НастройкаОтбораСписка) И НЕ ЭтотОбъект.Параметры.Свойство("ОбнаружениеИнцидента") Тогда
        
        НовыйОтбор = ВосстановитьОтбор(НастройкаОтбораСписка);
        КопироватьОтбор(ЭтотОбъект.Список.Отбор, НовыйОтбор);
        ЭтотОбъект.ОтборПредставление = Строка(НовыйОтбор);
        
        Если ЭтотОбъект.Список.Отбор.Элементы.Количество() > 0 Тогда
            ЭтотОбъект.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
            ЭтотОбъект.Элементы.КодДляПоиска.Видимость = Ложь;
            ЭтотОбъект.Элементы.КодДляПоискаСписок.Видимость = Истина;
        Иначе
            ЭтотОбъект.Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
            ЭтотОбъект.Элементы.КодДляПоиска.Видимость = Истина;
            ЭтотОбъект.Элементы.КодДляПоискаСписок.Видимость = Ложь;
        КонецЕсли;
        
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере(ЭтотОбъект.УникальныйИдентификатор);
	ЭтотОбъект.Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСписка(Команда)
    ОткрытьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтбор(Команда)
    
    ЭтотОбъект.Список.Отбор.Элементы.Очистить();
    НастройкаОтбораСписка = "";
    ЭтотОбъект.ОтборПредставление = "";
    ЭтотОбъект.Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
    ОбновитьСписок(Неопределено);
    
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЭлементы(Команда)
    
    ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменитьЭлементыЗакрытие", ЭтотОбъект);
    ПараметрыОткрытия = Неопределено;
    
    Если ЭтотОбъект.Элементы.Список.ТекущиеДанные <> Неопределено Тогда
        ПараметрыОткрытия = Новый Структура("КонтрольПоступленияДанных, ДопустимоеВремяОтсутствияДанных");
        ПараметрыОткрытия.КонтрольПоступленияДанных = ЭтотОбъект.Элементы.Список.ТекущиеДанные.КонтрольПоступленияДанных;
        ПараметрыОткрытия.ДопустимоеВремяОтсутствияДанных = ЭтотОбъект.Элементы.Список.ТекущиеДанные.ДопустимоеВремяОтсутствияДанных;
    КонецЕсли;
    
    ОткрытьФорму("Справочник.ГруппыСчетчиков.Форма.ФормаИзменитьЭлементы", ПараметрыОткрытия, ЭтотОбъект,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
    ОткрытьФорму("ОбщаяФорма.ФормаКонстантСтатистика");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    Если Поле.Имя = "Диаграмма" Тогда
        
        ДатаОкончания = ТекущаяДата();
        ДатаНачала = ДатаОкончания - 86400;
        ОбщийКлиент.ДиаграммаОбщаяСчетчикиПроизводительности(Элемент.ВыделенныеСтроки, ДатаНачала, ДатаОкончания, Новый УникальныйИдентификатор);
        СтандартнаяОбработка = Ложь;
        
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ОтборПредставлениеНажатие(Элемент, СтандартнаяОбработка)
    
    ОткрытьОтбор();
    СтандартнаяОбработка = Ложь;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменитьЭлементыЗакрытие(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
    
    Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
        ИзменитьЭлементыНаСервере(РезультатЗакрытия);
        ЭтотОбъект.Элементы.Список.Обновить();
    КонецЕсли;
        
КонецПроцедуры

&НаСервере
Процедура ИзменитьЭлементыНаСервере(ПараметрыИзменения)
    
    Для Каждого Счетчик Из ЭтотОбъект.Элементы.Список.ВыделенныеСтроки Цикл
        СчетчикОбъект = Счетчик.Ссылка.ПолучитьОбъект();
        СчетчикОбъект.КонтрольПоступленияДанных = ПараметрыИзменения.КонтрольПоступленияДанных;
        СчетчикОбъект.ДопустимоеВремяОтсутствияДанных = ПараметрыИзменения.ДопустимоеВремяОтсутствияДанных;
        СчетчикОбъект.Записать();
    КонецЦикла;
    ОбновитьСписокНаСервере(ЭтотОбъект.УникальныйИдентификатор);
    
КонецПроцедуры
    
&НаСервереБезКонтекста
Процедура ЗаполнитьТекущиеЗначения(УникальныйИдентификаторФормы)
	
	ТекДата = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Событие КАК Счетчик,
	|	МАКСИМУМ(Период) КАК ДатаЗаписи
	|ИЗ
	|	РегистрСведений.СтатистикаНеделя
	|ГДЕ
	|	Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|СГРУППИРОВАТЬ ПО
	|	Событие
	|";
	Запрос.УстановитьПараметр("ДатаНачала", ТекДата - 120);
	Запрос.УстановитьПараметр("ДатаОкончания", ТекДата);
	
	Результат = Запрос.Выполнить();
	
	НаборЗаписей = РегистрыСведений.ГруппыСчетчиковФормаСписка.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УникальныйИдентификаторФормы.Установить(УникальныйИдентификаторФормы);
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовЗапись = НаборЗаписей.Добавить();
		НовЗапись.Период = ТекДата;
		НовЗапись.УникальныйИдентификаторФормы = УникальныйИдентификаторФормы;
		НовЗапись.Счетчик = Выборка.Счетчик;
		НовЗапись.ДатаЗаписи = Выборка.ДатаЗаписи;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
			
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка,
	|	Родитель,
	|	ВЫБОР
	|		КОГДА КонтрольПоступленияДанных ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КонтрольПоступленияДанных 
	|ИЗ
	|	Справочник.ГруппыСчетчиков
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|ИТОГИ
	|	СУММА(КонтрольПоступленияДанных)
	|ПО
	|	Родитель ИЕРАРХИЯ
	|";
	Результат = Запрос.Выполнить();
	
	НаборЗаписей = РегистрыСведений.ГруппыСчетчиковФормаСпискаЕстьКонтрольПодчиненных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УникальныйИдентификаторФормы.Установить(УникальныйИдентификаторФормы);
	
	Выборка = Результат.Выбрать();
	
	ДобавленныеСчетчики = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии ИЛИ Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
			Если Выборка.КонтрольПоступленияДанных > 0 Тогда
				Если ДобавленныеСчетчики[Выборка.Родитель] = Неопределено Тогда
					НовЗапись = НаборЗаписей.Добавить();
					НовЗапись.Период = ТекДата;
					НовЗапись.УникальныйИдентификаторФормы = УникальныйИдентификаторФормы;
					НовЗапись.Счетчик = Выборка.Родитель;
					НовЗапись.ЕстьКонтрольПодчиненных = Истина;
					
					ДобавленныеСчетчики.Вставить(Выборка.Родитель, Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСписокНаСервере(УникальныйИдентификаторФормы)
	ЗаполнитьТекущиеЗначения(УникальныйИдентификаторФормы);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСчетчикиПоказателей(ОбнаружениеИнцидентов)
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |   СпрПоказателиСчетчиковСчетчики.Счетчик КАК Счетчик   
    |ИЗ
    |   Справочник.ПоказателиИнцидентов КАК СпрПоказателиИнцидентов
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |   Справочник.ПоказателиСчетчиков.Счетчики КАК СпрПоказателиСчетчиковСчетчики
    |ПО
    |   СпрПоказателиСчетчиковСчетчики.Ссылка = СпрПоказателиИнцидентов.Показатель
    |{ГДЕ
    |   СпрПоказателиИнцидентов.Владелец = &ОбнаружениеИнцидентов}
    |";
    
    Если ТипЗнч(ОбнаружениеИнцидентов) = Тип("СписокЗначений") Тогда
        Запрос.Текст = СтрЗаменить(
            Запрос.Текст,
            "{ГДЕ
            |   СпрПоказателиИнцидентов.Владелец = &ОбнаружениеИнцидентов}",
            "ГДЕ
            |   СпрПоказателиИнцидентов.Владелец В (&ОбнаружениеИнцидентов)");
    ИначеЕсли ТипЗнч(ОбнаружениеИнцидентов) = Тип("Неопределено") Тогда        
            Запрос.Текст = СтрЗаменить(
            Запрос.Текст,
            "{ГДЕ
            |   СпрПоказателиИнцидентов.Владелец = &ОбнаружениеИнцидентов}",
            "");
    Иначе
        Запрос.Текст = СтрЗаменить(
            Запрос.Текст,
            "{ГДЕ
            |   СпрПоказателиИнцидентов.Владелец = &ОбнаружениеИнцидентов}",
            "ГДЕ
            |   СпрПоказателиИнцидентов.Владелец = &ОбнаружениеИнцидентов");
    КонецЕсли;
    Запрос.УстановитьПараметр("ОбнаружениеИнцидентов", ОбнаружениеИнцидентов);
    
    Результат = Запрос.Выполнить();
    
    СЗнСчетчики = Новый СписокЗначений;
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        СЗнСчетчики.Добавить(Выборка.Счетчик);
    КонецЦикла;
        
    Возврат СЗнСчетчики;
    
КонецФункции

&НаКлиенте
Процедура ОткрытьОтбор()
    
    Если ЗначениеЗаполнено(НастройкаОтбораСписка) Тогда
        СохраненныйОтбор = ВосстановитьОтбор(НастройкаОтбораСписка);
    КонецЕсли;
    
	ПараметрыОткрытия = Новый Структура("Отбор", СохраненныйОтбор);
	ОткрытьФорму("Справочник.ГруппыСчетчиков.Форма.ФормаБыстрогоОтбора", ПараметрыОткрытия, ЭтотОбъект);
    
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьОтбор(НастройкаОтбораСписка, Знач Отбор)
	
	Поток = Новый ЗаписьXML();
	Поток.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(Поток, Отбор);
	НастройкаОтбораСписка = Поток.Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВосстановитьОтбор(НастройкаОтбораСписка)
	
	Поток = Новый ЧтениеXML();
	Поток.УстановитьСтроку(НастройкаОтбораСписка);
	НовыйОтбор = СериализаторXDTO.ПрочитатьXML(Поток);
	Поток.Закрыть();
	
	Возврат НовыйОтбор;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура КопироватьОтбор(ОтборПолучатель, ОтборИсточник)
    
    ОтборПолучатель.Элементы.Очистить();
    
    Для Каждого ТекЭлемент Из ОтборИсточник.Элементы Цикл
        Если ТипЗнч(ТекЭлемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
            КопироватьЭлементОбора(ОтборПолучатель.Элементы, ТекЭлемент);
        ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
            КопироватьГруппуОбора(ОтборПолучатель.Элементы, ТекЭлемент);
        КонецЕсли;
	КонецЦикла;
        
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура КопироватьЭлементОбора(ЭлементыОтбора, Элемент)
    
    НовЭлемент = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    
    Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОбнаружениеИнцидентов") Тогда
        
        НовЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
        НовЭлемент.Использование = Элемент.Использование;
                
        Если
            Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
            ИЛИ Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
            ИЛИ Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии
            ИЛИ Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии
            ИЛИ Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии
            ИЛИ Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии
        Тогда
            НовЭлемент.ПравоеЗначение = Новый СписокЗначений;
            НовЭлемент.ВидСравнения = Элемент.ВидСравнения;
            Для Каждого ТекЗначение Из Элемент.ПравоеЗначение Цикл
                СЗнСчетчиков = ПолучитьСчетчикиПоказателей(ТекЗначение.Значение);
                Для Каждого ТекСчетчик Из СЗнСчетчиков Цикл
                    НовЭлемент.ПравоеЗначение.Добавить(ТекСчетчик.Значение);
                КонецЦикла;
            КонецЦикла;
        ИначеЕсли Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда 
            НовЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
            НовЭлемент.ПравоеЗначение = ПолучитьСчетчикиПоказателей(Элемент.ПравоеЗначение);
        ИначеЕсли Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
            НовЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
            НовЭлемент.ПравоеЗначение = ПолучитьСчетчикиПоказателей(Элемент.ПравоеЗначение);
        ИначеЕсли Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
            НовЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
            НовЭлемент.ПравоеЗначение = ПолучитьСчетчикиПоказателей(Неопределено);
        ИначеЕсли Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
            НовЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
            НовЭлемент.ПравоеЗначение = ПолучитьСчетчикиПоказателей(Неопределено);
        КонецЕсли;
        
    ИначеЕсли Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КонтрольПоступленияДанных") Тогда
        
        Если
            Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
            ИЛИ Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
        Тогда    
            НовЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КонтрольПоступленияДанных");
            НовЭлемент.Использование = Элемент.Использование;
            НовЭлемент.ВидСравнения = Элемент.ВидСравнения;
            НовЭлемент.ПравоеЗначение = Число(Элемент.ПравоеЗначение);
        Иначе
            НовЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КонтрольПоступленияДанных");
            НовЭлемент.Использование = Элемент.Использование;
            НовЭлемент.ВидСравнения = Элемент.ВидСравнения;
        КонецЕсли;
        
    Иначе
        
        НовЭлемент.ЛевоеЗначение = Элемент.ЛевоеЗначение;
        НовЭлемент.Использование = Элемент.Использование;
        НовЭлемент.ВидСравнения = Элемент.ВидСравнения;
        НовЭлемент.ПравоеЗначение = Элемент.ПравоеЗначение;
        
    КонецЕсли;
    
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура КопироватьГруппуОбора(ЭлементыОтбора, ГруппаЭлементов)
    
    НовГруппа = ЭлементыОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    НовГруппа.Использование = ГруппаЭлементов.Использование;
    НовГруппа.ТипГруппы = ГруппаЭлементов.ТипГруппы;
    
    Для Каждого ТекЭлемент Из ГруппаЭлементов.Элементы Цикл
        Если ТипЗнч(ТекЭлемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
            КопироватьЭлементОбора(НовГруппа.Элементы, ТекЭлемент);
        ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
            КопироватьГруппуОбора(НовГруппа.Элементы, ТекЭлемент);
        КонецЕсли;
    КонецЦикла;
        
КонецПроцедуры

#КонецОбласти
